## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 0 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_iam_policy.parameters_csi`                           |
|        | `aws_iam_role.secrets_csi_blazer`                         |
|        | `aws_iam_role.secrets_csi_nginx`                          |
|        | `aws_iam_role_policy_attachment.parameters_csi_blazer`    |
|        | `aws_iam_role_policy_attachment.parameters_csi_nginx`     |
|        | `aws_iam_role_policy_attachment.secrets_csi_blazer`       |
|        | `aws_iam_role_policy_attachment.secrets_csi_nginx`        |
|        | `aws_lb_listener.internal_alb-80`                         |
|        | `aws_security_group_rule.database-tools-internal-egress`  |
|        | `aws_security_group_rule.database-tools-internal-ingress` |
| delete | `aws_iam_role.secrets_csi`                                |
|        | `aws_iam_role_policy_attachment.secrets_csi`              |
|        | `aws_iam_role_policy_attachment.worker_csi`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.parameters_csi will be created
  + resource "aws_iam_policy" "parameters_csi" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "parameters-csi-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:Describe*",
                          + "ssm:Get*",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:GetParametersByPath",
                          + "ssm:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:239043911459:parameter*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.secrets_csi will be destroyed
  # (because aws_iam_role.secrets_csi is not in configuration)
  - resource "aws_iam_role" "secrets_csi" {
      - arn                   = "arn:aws:iam::239043911459:role/secrets-csi-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-02-01T18:02:30Z" -> null
      - force_detach_policies = false -> null
      - id                    = "secrets-csi-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::239043911459:policy/secrets-csi-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "secrets-csi-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROATPKBAT4RZWI4XJLJ6" -> null
    }

  # aws_iam_role.secrets_csi_blazer will be created
  + resource "aws_iam_role" "secrets_csi_blazer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:tools:blazer"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "secrets-csi-role-blazer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.secrets_csi_nginx will be created
  + resource "aws_iam_role" "secrets_csi_nginx" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "secrets-csi-role-nginx"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.parameters_csi_blazer will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_blazer" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secrets-csi-role-blazer"
    }

  # aws_iam_role_policy_attachment.parameters_csi_nginx will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_nginx" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secrets-csi-role-nginx"
    }

  # aws_iam_role_policy_attachment.secrets_csi will be destroyed
  # (because aws_iam_role_policy_attachment.secrets_csi is not in configuration)
  - resource "aws_iam_role_policy_attachment" "secrets_csi" {
      - id         = "secrets-csi-role-20240201180230555200000002" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy" -> null
      - role       = "secrets-csi-role" -> null
    }

  # aws_iam_role_policy_attachment.secrets_csi_blazer will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_blazer" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
      + role       = "secrets-csi-role-blazer"
    }

  # aws_iam_role_policy_attachment.secrets_csi_nginx will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_nginx" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy"
      + role       = "secrets-csi-role-nginx"
    }

  # aws_iam_role_policy_attachment.worker_csi will be destroyed
  # (because aws_iam_role_policy_attachment.worker_csi is not in configuration)
  - resource "aws_iam_role_policy_attachment" "worker_csi" {
      - id         = "eks-worker-role-20240201180230485600000001" -> null
      - policy_arn = "arn:aws:iam::239043911459:policy/secrets-csi-policy" -> null
      - role       = "eks-worker-role" -> null
    }

  # aws_lb_listener.internal_alb-80 will be created
  + resource "aws_lb_listener" "internal_alb-80" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ca-central-1:239043911459:loadbalancer/app/notify-staging-internal-alb/0c48dcc4ceddfc88"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_security_group_rule.database-tools-internal-egress will be created
  + resource "aws_security_group_rule" "database-tools-internal-egress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow Internal access to blazer DB"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0073304c259d1620a"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.database-tools-internal-ingress will be created
  + resource "aws_security_group_rule" "database-tools-internal-ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow Internal access to blazer DB"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0073304c259d1620a"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 10 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  - eks_csi_role_arn                       = "arn:aws:iam::239043911459:role/secrets-csi-role" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
